modulos/modulo_03/crypto_wallet/lib/tasks/dev.rake

  task add_coins: :environment do
    show_spinner("Cadastrando Moedas...") do
      coins = [
        { description: "Bitcoin",
          acronym: "BTC",
          url_image: "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSixU_vNiGd5rmhMPjwDixDfDUb2zj09Gm2qg&usqp=CAU",
          mining_type: MiningType.find_by(acronym: 'PoW')
        },
        { description: "Ethereum",
          acronym: "ETH",
          url_image: "https://www.digitalhot.com.br/wp-content/uploads/2017/07/O-que-e-ethereum.png",
          mining_type: MiningType.all.sample },
        { description: "Dash",
          acronym: "DASH",
          url_image: "https://s3.cointelegraph.com/storage/uploads/view/6c9ae354d0ca897e55598ee6a8bf3e10.png",
          mining_type: MiningType.all.sample },
      ]

      coins.each do |coin|
        Coin.find_or_create_by!(coin)
---
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSixU_vNiGd5rmhMPjwDixDfDUb2zj09Gm2qg&usqp=CAU"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)

  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types = [
        {description: "Proof of Work", acronym: "PoW"},
        {description: "Proof of Stake", acronym: "PoS"},
        {description: "Proof of Capacity", acronym: "PoC"}
      ]

      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)
---
INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2021-06-14 23:34:19.831319"], ["updated_at", "2021-06-14 23:34:19.831319"]]