modulos/modulo_03/crypto_wallet/app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://s3.cointelegraph.com/storage/uploads/view/6c9ae354d0ca897e55598ee6a8bf3e10.png"], ["updated_at", "2021-06-05 23:39:14.197064"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 3]]
---
  def destroy
    @coin.destroy

SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"
---
    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_coin
      @coin = Coin.find(params[:id])